#### Ordinal Number Encoding

In [1]:
import datetime

In [2]:
today_date=datetime.datetime.today()

In [3]:
today_date

datetime.datetime(2020, 9, 12, 10, 49, 22, 117352)

In [4]:
today_date-datetime.timedelta(3)

datetime.datetime(2020, 9, 9, 10, 49, 22, 117352)

In [5]:
### List comprehesion
days=[today_date-datetime.timedelta(x) for x in range(0,15)]

In [6]:
import pandas as pd
data=pd.DataFrame(days)

In [7]:
data.columns=['Day']

In [8]:
data.head()

                         Day
0 2020-09-12 10:49:22.117352
1 2020-09-11 10:49:22.117352
2 2020-09-10 10:49:22.117352
3 2020-09-09 10:49:22.117352
4 2020-09-08 10:49:22.117352

In [9]:
# weekday name is change you will have write day_name
data['Weekday']=data['Day'].dt.day_name()

In [10]:
data.head()

                         Day    Weekday
0 2020-09-12 10:49:22.117352   Saturday
1 2020-09-11 10:49:22.117352     Friday
2 2020-09-10 10:49:22.117352   Thursday
3 2020-09-09 10:49:22.117352  Wednesday
4 2020-09-08 10:49:22.117352    Tuesday

In [11]:
dictionary={'Monday':1,'Tuesday':2,'wednesday':3,'Thrusday':4,'Friday':5,'Saturday':6,'Sunday':7
           
           
           }

In [12]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'wednesday': 3,
 'Thrusday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [13]:
data['Weekday_ordinal']=data['Weekday'].map(dictionary)

In [14]:
data.head()

                         Day    Weekday  Weekday_ordinal
0 2020-09-12 10:49:22.117352   Saturday              6.0
1 2020-09-11 10:49:22.117352     Friday              5.0
2 2020-09-10 10:49:22.117352   Thursday              NaN
3 2020-09-09 10:49:22.117352  Wednesday              NaN
4 2020-09-08 10:49:22.117352    Tuesday              2.0

#### Count or Frequency Encoding

In [15]:
train=pd.read_csv('adult.csv')
train.head(5)

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,target
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [16]:
columns=['workclass','education','marital.status','occupation','relationship','race','sex','native.country']

In [17]:
train[columns]

,workclass,education,marital.status,occupation,relationship,race,sex,native.country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States

In [18]:
for feature in columns[:]:
    print(feature,":",len(train[feature].unique()))

workclass : 9
education : 16
marital.status : 7
occupation : 15
relationship : 6
race : 5
sex : 2
native.country : 42

In [19]:
country_map=train['native.country'].value_counts().to_dict()

In [20]:
train['native.country']=train['native.country'].map(country_map)

In [21]:
train.head()

,age,workclass,fnlwgt,education,education.num,marital.status,occupation,relationship,race,sex,capital.gain,capital.loss,hours.per.week,native.country,target
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,29170.0,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,29170.0,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,29170.0,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,29170.0,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,95.0,<=50K

### Advantages
- easy to use
- not increasing feature space
### Disadvantages
- it will provide same weight if the frequency are same

###  Target Guided ordinal encoding
- ordering the label according to the target
- Replace the labels by the joint probability of being 1 or  0

In [22]:
import pandas as pd
df=pd.read_csv('titanic (3).csv',usecols=['Cabin','Survived'])

In [23]:
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [24]:
df.Cabin.fillna('missing',inplace=True)

In [25]:
df.head()

   Survived    Cabin
0         0  missing
1         1      C85
2         1  missing
3         1     C123
4         0  missing

In [26]:
df.Cabin=df.Cabin.astype(str).str[0]

In [27]:
df.head()

   Survived Cabin
0         0     m
1         1     C
2         1     m
3         1     C
4         0     m

In [28]:
df.Cabin.unique()

array(['m', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [29]:
len(df.Cabin.unique())

9

In [30]:
df.groupby(['Cabin'])['Survived'].mean()

Cabin
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
T    0.000000
m    0.299854
Name: Survived, dtype: float64

In [31]:
df.groupby(['Cabin'])['Survived'].mean().sort_values()

Cabin
T    0.000000
m    0.299854
A    0.466667
G    0.500000
C    0.593220
F    0.615385
B    0.744681
E    0.750000
D    0.757576
Name: Survived, dtype: float64

In [32]:
df.groupby(['Cabin'])['Survived'].mean().sort_values().index

Index(['T', 'm', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin')

In [33]:
ordinal_labels=df.groupby(['Cabin'])['Survived'].mean().sort_values().index

In [34]:
enumerate(ordinal_labels)

In [35]:
# here i is for ordial_labels and j is for indexs like 0,1,2 etc 
ordinal_labels2={i:j for j,i in enumerate(ordinal_labels,0)}
ordinal_labels2

{'T': 0, 'm': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [36]:
df['Cabin_ordinal']=df['Cabin'].map(ordinal_labels2)

In [37]:
df.head()

   Survived Cabin  Cabin_ordinal
0         0     m              1
1         1     C              4
2         1     m              1
3         1     C              4
4         0     m              1

### Mean Encoding

In [40]:
mean_ordinal=df.groupby(['Cabin'])['Survived'].mean().to_dict()

In [41]:
mean_ordinal

{'A': 0.4666666666666667,
 'B': 0.7446808510638298,
 'C': 0.5932203389830508,
 'D': 0.7575757575757576,
 'E': 0.75,
 'F': 0.6153846153846154,
 'G': 0.5,
 'T': 0.0,
 'm': 0.29985443959243085}

In [42]:
df['mean_ordinal_encoding']=df['Cabin'].map(mean_ordinal)

In [43]:
df.head()

   Survived Cabin  Cabin_ordinal  mean_ordinal_encoding
0         0     m              1               0.299854
1         1     C              4               0.593220
2         1     m              1               0.299854
3         1     C              4               0.593220
4         0     m              1               0.299854